#+TITLE: Emacs: DText Mode
#+STARTUP: content hideblocks

* DONE Font Lock
  :LOGBOOK:
  CLOCK: [2023-10-28 Sat 17:15]--[2023-10-28 Sat 18:19] =>  1:04
  CLOCK: [2023-10-28 Sat 16:36]--[2023-10-28 Sat 16:45] =>  0:09
  CLOCK: [2023-10-28 Sat 16:14]--[2023-10-28 Sat 16:33] =>  0:19
  CLOCK: [2023-10-28 Sat 12:11]--[2023-10-28 Sat 12:56] =>  0:45
  :END:

~dtext-font-lock-keywords~ based on ~bbcode-font-lock-keywords~ in
~bbcode-mode.el~.[fn:1]

One of the highlighting rules is for opening tags:

#+caption: bbcode-mode.el
#+begin_src emacs-lisp -n 87
`(;; Opening tag.
  (,(concat (regexp-quote "[")
            (regexp-opt (mapcar #'car bbcode-tags) t)
            "]")
   (0 'font-lock-keyword-face))
#+end_src

So basically, if we use ~[b]~ as an example, then the entire string is
highlighted with ~font-lock-keyword-face~.

* Documentation
   :LOGBOOK:
   CLOCK: [2023-10-28 Sat 19:23]--[2023-10-28 Sat 19:38] =>  0:15
   :END:

<2023-10-28 Sat 19:23> - Writing documentation for major mode.
<2023-10-28 Sat 19:38> - Wrote basic documentation.

* DText Additions
** Tags

- [ ] tn (e.g., ~[tn]example[/tn]~)
- [ ] spoilers (e.g., ~[spoilers]example[/spoilers]~)
- [ ] nodtext (e.g., ~[nodtext]example[/nodtext]~)
- [ ] expand (see *[[Expand Tag]]*)

*** Expand Tag

#+caption: Demonstration
#+begin_src bbcode
[expand]
This creates a collaspible block of text.
[/expand]

[expand=Custom Title]
This creates a collaspible block of text.
[/expand]
#+end_src

** Links
   :LOGBOOK:
   CLOCK: [2023-10-29 Sun 03:28]--[2023-10-29 Sun 03:32] =>  0:04
   CLOCK: [2023-10-29 Sun 02:51]--[2023-10-29 Sun 03:03] =>  0:12
   :END:

#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2023-10-29 Sun 04:02]
| Headline     | Time   |      |
|--------------+--------+------|
| *Total time* | *0:16* |      |
|--------------+--------+------|
| \_  Links    |        | 0:16 |
#+END:

*** URL Links

- [ ] bare link (e.g., ~example.com~)
- [ ] angled link (e.g., ~<example.com>~
- [ ] link with text (e.g., ~"Example":[example.com]~)
- [ ] Markdown-style link (e.g., ~[Example](example.com)~)
- [ ] wiki links [0/3]
  - [ ] normal link (e.g., ~[[Kantai Collection]]~)
  - [ ] link with alternate text (e.g., ~[[Kantai Collection|Kancolle]]~)
  - [ ] link sans qualfieir (e.g., ~[[Fate (series)|]]~)
- [ ] search link (e.g. ~{{kantai_collection comic}}~)
- [ ] user (e.g., ~@bob~)

*** Post Links

- [ ] link to post (e.g., ~post #1~)
- [ ] link to forum topic (e.g., ~topic #1~)
- [ ] link to forum topic (page 2) (e.g., ~topic #1/2~)
- [ ] link to forum post (e.g., ~forum #1~)
- [ ] link to comment (e.g., ~comment #1~)
- [ ] link to pool (e.g., ~pool #1~)
- [ ] link to favorite group (e.g., ~favgroup #1~)
- [ ] link to wiki (e.g., ~wiki #1~)
- [ ] link to user (e.g., ~user #1~)
- [ ] link to ban (e.g., ~ban #1~)
- [ ] link to user feedback (e.g., ~feedback #1~)
- [ ] link to ban appeal (e.g., ~appeal #1~)
- [ ] link to post flag (e.g., ~flag #1~)
- [ ] link to translation note (e.g., ~note #1~)
- [ ] link to bulk update request (e.g., ~BUR #1~)
- [ ] link to tag alias (e.g., ~alias #1~)
- [ ] link to tag implication (e.g., ~implication #1~)
- [ ] link to mod action (e.g., ~mod action #1~)
- [ ] link to artist (e.g., ~artist #1~)

----------

- [ ] link to Github issue (e.g., ~issue #1~)
- [ ] link to Pixiv post (e.g., ~pixiv #1~)
- [ ] link to Pawoo post (e.g., ~pawoo #1~)
- [ ] link to NicoSeiga post (e.g., ~seiga #1~)
- [ ] link to Nijie post (e.g., ~nijie #1~)
- [ ] link to Twitter post (e.g., ~twitter #1~)
- [ ] link to DeviantArt post (e.g., ~deviantart #1~)
- [ ] link to ArtStation post (e.g., ~artstation #1~)
- [ ] link to Sankaku post (e.g., ~sankaku #1~)
- [ ] link to Gelbooru post (e.g., ~gelbooru #1~)
- [ ] link to Yande.re post (e.g., ~yandere #1~)

** Tables

#+caption: Table syntax
#+begin_src bbcode
[table]
  [thead]
    [tr]
      [td]A[/td]
      [td]B[/td]
      [td]C[/td]
    [/tr]
  [/thead]
  [tbody]
    [tr]
      [td]1[/td]
      [td]2[/td]
      [td]3[/td]
    [/tr]
    [tr]
      [td]4[/td]
      [td]5[/td]
      [td]6[/td]
    [/tr]
  [/tbody]
[/table]
#+end_src

This creates the following result:

| A | B | C |
|---+---+---|
| 1 | 2 | 3 |
| 4 | 5 | 6 |

Mainly need a command for inserting tables, not really any extra
syntax/highlighting for them.

** Headers
   SCHEDULED: <2023-10-29 Sun 12:00>

...

** Lists

#+caption: A demonstration of lists
#+begin_src bbcode
​* item 1
​* item2
​** item 2.a
​** item 2.b
​* item 3
#+end_src

Output:

- item 1
- item2
  - item 2.a
  - item 2.b
- item 3

** HTML Tags

Some day in the future, but not anytime soon.

* DONE DText Subtractions
   :LOGBOOK:
   CLOCK: [2023-10-28 Sat 20:07]--[2023-10-28 Sat 20:41] =>  0:34
   :END:

Removed tags:

- *
- color
- del
- email
- font
- gvideo
- li
- list
- manual
- ol
- size
- style
- ul
- url
- wiki
- youtube
- center

* Footnotes

[fn:1] file:/home/john/.emacs.d/elpa/bbcode-mode-20190304.2122/bbcode-mode.el
